Apply ds-review-readme
